//∙MDPN
#pragma once

#include <core/platform.h>
#include <core/util.h>

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//   ThreadTime - получение процессорного времени работы потока
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//----------------------------------------------------------------------------------------------------------------------
class ThreadTime
{
	AML_NONCOPYABLE(ThreadTime)

public:
	ThreadTime();
	~ThreadTime();

	// Сбрасывает счётчик времени
	void Reset();

	// Возвращает суммарное время работы потока (в микросекундах)
	// с момента последнего сброса или создания объекта класса
	uint64_t GetElapsed(bool reset = false);

protected:
	void* m_ThreadHandle = nullptr;
	uint64_t m_KernelTime = 0;
	uint64_t m_UserTime = 0;
};
