//⬪AML⬪
#pragma once

#include "platform.h"
#include "util.h"

#include <type_traits>

namespace thread {

class CriticalSection;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//   Lock
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Класс Lock делает работу с примитивами синхронизации удобнее. При объявлении локальной переменной этого
// типа примитив будет захвачен (опционально), а при её выходе из области видимости - автоматически освобождён

//----------------------------------------------------------------------------------------------------------------------
template<class T>
class Lock final
{
	AML_NONCOPYABLE(Lock)
	static_assert(std::is_base_of<CriticalSection, T>::value, "Unsupported type");

public:
	explicit Lock(T* pSyncObj, bool acquire = true)
		: m_pObj(pSyncObj)
	{
		if (pSyncObj && acquire)
			pSyncObj->Enter();
	}

	explicit Lock(T& syncObj, bool acquire = true)
		: m_pObj(&syncObj)
	{
		if (acquire)
			syncObj.Enter();
	}

	~Lock()
	{
		if (m_pObj)
			m_pObj->Leave();
	}

	void Leave()
	{
		if (m_pObj)
		{
			m_pObj->Leave();
			m_pObj = nullptr;
		}
	}

private:
	T* m_pObj;
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//   CriticalSection
//
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Класс CriticalSection реализует критическую секцию со спинлоком, поддерживающую возможность
// приостановки потока до момента освобождения секции, используя средства операционной системы

//----------------------------------------------------------------------------------------------------------------------
class CriticalSection
{
	AML_NONCOPYABLE(CriticalSection)

public:
	using Lock = Lock<CriticalSection>;

	// Инициализация критической секции. Параметр spinCount задаёт количество циклов ожидания
	// (в случае занятости секции другим потоком) до обращения к функциям ОС ожидания освобождения
	// секции (что обычно обходится достаточно дорого). Если значение равно 0, то цикла ожидания
	// не будет (значение игнорируется на системах с одним логическим процессором)
	explicit CriticalSection(unsigned spinCount = 0);
	~CriticalSection();

	bool TryEnter();
	void Enter();
	void Leave();

private:
	void* m_pData;			// Указатель на структуру данных критической секции ОС
	uint8_t m_DataA[40];	// Локальный буфер для структуры данных критической секции
};

} // namespace thread
